chenyurong22/STM32-EC200-Firmware/src/ota.c
/* ota.c — OTA firmware update state machine (Reliable Stream Mode for EC200U)
 * Final stable version - Direct QHTTPREAD
 */

#include "ota.h"
#include "main.h"
#include "modem.h"
#include "stm32g0xx_hal.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/* External */
extern IWDG_HandleTypeDef hiwdg;

/* Config */
#define OTA_STATUS_TOPIC            "pump/" PUMP_ID "/ota/status"
#define OTA_CHUNK_SIZE              256U
#define OTA_PROGRESS_EVERY          4096U
#define OTA_CMD_TIMEOUT_MS          120000UL
#define OTA_READ_TIMEOUT_MS         45000UL
#define OTA_SSL_STEP_TIMEOUT_MS     15000UL
#define OTA_HTTPGET_MAX_RETRIES     3U
#define OTA_HTTPGET_RETRY_DELAY_MS  5000UL
#define OTA_HTTPREAD_MAX_RETRIES    2U
#define OTA_STREAM_BUF_SIZE         2048U
#define OTA_STREAM_YIELD_THRESHOLD  1024U

/* States */
typedef enum
{
    OTA_ST_IDLE,
    OTA_ST_SSL_ENABLE,
    OTA_ST_SSL_SECLEVEL,
    OTA_ST_SSL_CACERT,
    OTA_ST_SSL_VERSION,
    OTA_ST_SSL_CIPHER,
    OTA_ST_SSL_CTXID,
    OTA_ST_HTTP_URL_CMD,
    OTA_ST_HTTP_URL_BODY,
    OTA_ST_HTTP_GET,
    OTA_ST_PREERASE,        /* non-blocking Slot B erase, one page per OTA_Process call */
    OTA_ST_HTTP_READFILE,
    OTA_ST_FLAG_WRITE,
    OTA_ST_REBOOT,
    OTA_ST_ERROR
} OTA_State;

/* Variables */
static OTA_State ota_state = OTA_ST_IDLE;
static char ota_url[256];
static uint32_t ota_file_size = 0;
static uint32_t ota_offset = 0;
static uint32_t ota_crc32 = 0xFFFFFFFFUL;
static uint32_t ota_last_progress = 0;
static uint32_t ota_state_ms = 0;
static uint32_t ota_timeout_ms = 0;

static bool ota_stream_active = false;
static bool ota_stream_rx_complete = false;
static uint32_t ota_stream_remaining = 0;
static bool     ota_stream_wait_payload = false;
static bool     ota_httpread_stream_started = false;
static bool     ota_httpread_done_urc = false;
static bool     ota_slot_preerased = false;     /* Slot B erase complete flag */
static uint32_t ota_preerase_page_idx = 0;     /* page counter for non-blocking erase */

static uint8_t  ota_httpget_retries = 0;
static uint8_t  ota_httpread_retries = 0;

/* Buffers */
static uint8_t  ota_bin_buf[OTA_CHUNK_SIZE];

/* Bug4: 8-byte doubleword accumulator for unaligned flash writes */
static uint8_t  ota_dw_buf[8];
static uint32_t ota_dw_len = 0;        /* bytes accumulated in ota_dw_buf */
static uint32_t ota_dw_prog_off = 0;   /* flash write offset (always 8-byte aligned) */

static uint8_t  ota_stream_buf[OTA_STREAM_BUF_SIZE];
static uint32_t ota_stream_buf_head = 0;
static uint32_t ota_stream_buf_tail = 0;
static uint32_t ota_stream_buf_count = 0;

/* Callbacks */
static OTA_SendFn    ota_send_fn    = NULL;
static OTA_PublishFn ota_publish_fn = NULL;
static OTA_RecvFn    ota_recv_fn    = NULL;

/* Sentinel in .noinit RAM: survives NVIC_SystemReset but not POR.
 * Written just before the intentional OTA reboot so modem.c can
 * distinguish true OTA reset from an unexpected HardFault reset. */
#define OTA_REBOOT_SENTINEL 0xDEADBEEFUL
static volatile uint32_t ota_reboot_sentinel __attribute__((section(".noinit")));

/* Second sentinel: set AFTER AT+CFUN=1,1 completes in OTA_ST_REBOOT,
 * meaning the modem has already been reset and LTE re-registration has
 * been running for ~75 s before the STM32 reboots.  Modem_Init checks
 * this to skip its own CFUN step and just settle briefly instead.      */
#define OTA_CFUN_DONE_SENTINEL 0xCAFEBABEUL
static volatile uint32_t ota_cfun_done_sentinel __attribute__((section(".noinit")));

/* Prototypes */
static void ota_stream_buf_reset(void);
static bool ota_stream_buf_push(uint8_t b);
static uint32_t ota_stream_buf_pop_chunk(uint8_t *dst, uint32_t max_len);
static void ota_recover_http_bearer(void);
static void ota_delay_wdg(uint32_t ms);
static bool ota_wait_app_rdy(uint32_t timeout_ms);
static void ota_send_qhttpget(void);
static void ota_delete_stale_file(void);
static bool ota_retry_qhttpget(const char *reason);
static bool ota_retry_qhttpread(const char *reason);
static void ota_heal_https_ctx(void);
static bool ota_is_exact_reboot_urc(const char *line);
static bool ota_flash_flush_pending(void); /* Bug4 */

/* CRC32 */
static uint32_t crc32_update(uint32_t crc, const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int j = 0; j < 8; j++)
            crc = (crc >> 1) ^ (0xEDB88320UL & -(crc & 1));
    }
    return crc;
}

/* Helpers */
static void ota_send(const char *cmd)
{
    if (ota_send_fn) {
        ota_send_fn(cmd);
        ota_send_fn("\r\n");
    }
}

static void ota_publish(const char *payload)
{
    if (ota_publish_fn)
        ota_publish_fn(OTA_STATUS_TOPIC, payload);
}

static void ota_enter(OTA_State s, uint32_t timeout_ms)
{
    ota_state = s;
    ota_state_ms = HAL_GetTick();
    ota_timeout_ms = timeout_ms;
    char dbg[64];
    snprintf(dbg, sizeof(dbg), "[OTA] Enter state %d, timeout %lu ms\r\n", (int)s, (unsigned long)timeout_ms);
    Debug_Print(dbg);
}

static void ota_error(const char *reason)
{
    ota_stream_active = false;
    ota_stream_rx_complete = false;
    ota_stream_remaining = 0;
    ota_httpread_stream_started = false;
    ota_httpread_done_urc = false;
    ota_stream_buf_reset();

    char msg[128];
    snprintf(msg, sizeof(msg), "{\"ota_status\":\"error\",\"reason\":\"%s\"}", reason);
    ota_publish(msg);

    ota_send("AT+QHTTPSTOP");
    ota_enter(OTA_ST_ERROR, 0);

    char dbg[64];
    snprintf(dbg, sizeof(dbg), "[OTA] Error: %s\r\n", reason);
    Debug_Print(dbg);
}

static void ota_delay_wdg(uint32_t ms)
{
    uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < ms) {
        HAL_IWDG_Refresh(&hiwdg);
        HAL_Delay(50);
    }
    HAL_IWDG_Refresh(&hiwdg);
}

/* Poll UART for the "APP RDY" line from EC200U after AT+CFUN=1,1.
 * Returns true if "APP RDY" is seen within timeout_ms; false on timeout.
 * Refreshes IWDG on every byte poll iteration (~1 ms each).
 * Falls back to a timed wait (returns false) if ota_recv_fn is NULL.   */
static bool ota_wait_app_rdy(uint32_t timeout_ms)
{
    if (!ota_recv_fn) {
        /* No receive callback — just wait the full time; caller decides
         * whether to set cfun_done sentinel based on the return value.  */
        ota_delay_wdg(timeout_ms);
        return false;
    }
    char line[32]; int lpos = 0;
    uint32_t t0 = HAL_GetTick();
    while (HAL_GetTick() - t0 < timeout_ms) {
        HAL_IWDG_Refresh(&hiwdg);
        uint8_t c;
        if (ota_recv_fn(&c, 1) != 0) continue; /* 1 ms byte timeout */
        if (c == '\r') continue;
        if (c == '\n') {
            line[lpos] = '\0';
            if (lpos > 0 && strcmp(line, "APP RDY") == 0) return true;
            lpos = 0;
        } else if (lpos < (int)sizeof(line) - 1) {
            line[lpos++] = (char)c;
        }
    }
    return false; /* timeout */
}

static void ota_recover_http_bearer(void)
{
    Debug_Print("[OTA] Strong PDP recovery after 709\r\n");
    ota_send("AT+QIDEACT=1");     ota_delay_wdg(1500);
    ota_send("AT+QIACT=1");       ota_delay_wdg(5000);
    ota_send("AT+QIACT=1");       ota_delay_wdg(2000);
    ota_send("AT+QIDNSCFG=1,\"8.8.8.8\",\"1.1.1.1\""); ota_delay_wdg(300);
    ota_send("AT+QHTTPCFG=\"contextid\",1"); ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"sslctxid\",1");  ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"ssl\",1");       ota_delay_wdg(200);
}

static void ota_delete_stale_file(void)
{
    ota_send("AT+QFDEL=\"HTTP_GETFILE\"");
    ota_delay_wdg(200);
}

