chenyurong22/STM32-EC200-Firmware/src/ota.c
static void ota_send_qhttpget(void)
{
    char cmd[32];
    snprintf(cmd, sizeof(cmd), "AT+QHTTPGET=%lu", (unsigned long)((OTA_CMD_TIMEOUT_MS - 10000UL) / 1000UL));
    ota_send(cmd);
}

/* Retry Functions */
static bool ota_retry_qhttpget(const char *reason)
{
    if (ota_httpget_retries >= OTA_HTTPGET_MAX_RETRIES) return false;
    ota_httpget_retries++;

    char dbg[96];
    snprintf(dbg, sizeof(dbg), "[OTA] Retrying QHTTPGET (%u/%u) after %s\r\n", 
             ota_httpget_retries, OTA_HTTPGET_MAX_RETRIES, reason ? reason : "error");
    Debug_Print(dbg);

    ota_send("AT+QHTTPSTOP");
    ota_delay_wdg(OTA_HTTPGET_RETRY_DELAY_MS);

    if (reason && strstr(reason, "709"))
        ota_recover_http_bearer();

    ota_delete_stale_file();
    ota_send_qhttpget();
    ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
    return true;
}

static bool ota_retry_qhttpread(const char *reason)
{
    if (ota_httpread_retries >= OTA_HTTPREAD_MAX_RETRIES) return false;
    ota_httpread_retries++;

    char dbg[96];
    snprintf(dbg, sizeof(dbg), "[OTA] Retrying QHTTPREAD (%u/%u) after %s\r\n", 
             ota_httpread_retries, OTA_HTTPREAD_MAX_RETRIES, reason ? reason : "error");
    Debug_Print(dbg);

    ota_enter(OTA_ST_HTTP_READFILE, OTA_READ_TIMEOUT_MS);
    OTA_ForceHttpReadStream();
    ota_delay_wdg(800);

    char cmd[64];
    snprintf(cmd, sizeof(cmd), "AT+QHTTPREAD=%lu", (unsigned long)(OTA_CMD_TIMEOUT_MS / 1000UL));
    ota_send(cmd);
    return true;
}

static void ota_heal_https_ctx(void)
{
    Debug_Print("[OTA] Healing HTTPS context for 732 error\r\n");
    ota_send("AT+QSSLCFG=\"ignorelocaltime\",1,1"); ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"ssl\",1");               ota_delay_wdg(200);
}

static bool ota_is_exact_reboot_urc(const char *line)
{
    if (!line || !line[0]) return false;
    return (strcmp(line, "RDY") == 0 || strcmp(line, "+CFUN: 1") == 0);
}

/* Stream Buffer */
static void ota_stream_buf_reset(void)
{
    ota_stream_buf_head = ota_stream_buf_tail = ota_stream_buf_count = 0;
}

static bool ota_stream_buf_push(uint8_t b)
{
    if (ota_stream_buf_count >= OTA_STREAM_BUF_SIZE) return false;
    ota_stream_buf[ota_stream_buf_head] = b;
    ota_stream_buf_head = (ota_stream_buf_head + 1) % OTA_STREAM_BUF_SIZE;
    ota_stream_buf_count++;
    return true;
}

static uint32_t ota_stream_buf_pop_chunk(uint8_t *dst, uint32_t max_len)
{
    uint32_t n = 0;
    while (n < max_len && ota_stream_buf_count > 0) {
        dst[n++] = ota_stream_buf[ota_stream_buf_tail];
        ota_stream_buf_tail = (ota_stream_buf_tail + 1) % OTA_STREAM_BUF_SIZE;
        ota_stream_buf_count--;
    }
    return n;
}

/* Flash Helpers */

/* Erase one 2KB flash page.  IWDG is kicked before and after the HAL call.
 * HAL_FLASH_Lock/Unlock use FLASH_WaitForLastOperation(1000 ms) — safe given
 * the 18.7 s minimum IWDG timeout.  Actual erase takes ~30 ms. */
static bool ota_erase_page_safe(uint32_t page_num)
{
    IWDG->KR = 0xAAAAU;   /* kick before potentially blocking HAL ops */

    FLASH_EraseInitTypeDef er = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Banks     = FLASH_BANK_1,
        .Page      = page_num,
        .NbPages   = 1
    };
    uint32_t page_err = 0xFFFFFFFFUL;
    HAL_FLASH_Unlock();
    FLASH->SR = FLASH_SR_CLEAR;   /* clear stale error flags (e.g. OPTVERR after STLink flash) */
    HAL_StatusTypeDef st = HAL_FLASHEx_Erase(&er, &page_err);
    HAL_FLASH_Lock();
    IWDG->KR = 0xAAAAU;   /* kick after */

    if (st != HAL_OK || page_err != 0xFFFFFFFFUL) {
        char _d[56];
        snprintf(_d, sizeof(_d), "[OTA] erase FAIL p=%lu st=%d err=%08lX\r\n",
                 (unsigned long)page_num, (int)st, (unsigned long)page_err);
        Debug_Print(_d);
        return false;
    }
    return true;
}

/* Write exactly one 8-byte doubleword to flash at the given address. */
static bool flash_write_dword(uint32_t addr, const uint8_t *src)
{
    uint64_t dw;
    memcpy(&dw, src, 8);
    return HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, dw) == HAL_OK;
}

/* Bug4: Flush any buffered partial doubleword (padded with 0xFF) to flash. */
static bool ota_flash_flush_pending(void)
{
    if (ota_dw_len == 0) return true;
    uint8_t pad[8] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
    memcpy(pad, ota_dw_buf, ota_dw_len);
    uint32_t addr = OTA_SLOT_B_ADDR + ota_dw_prog_off;
    HAL_FLASH_Unlock();
    bool ok = flash_write_dword(addr, pad);
    HAL_FLASH_Lock();
    if (ok) {
        ota_dw_prog_off += 8;
        ota_dw_len = 0;
    }
    return ok;
}

/* Bug4: Accumulate bytes into 8-byte chunks before writing to flash.
 * Only complete doublewords are written; remainder stays in ota_dw_buf. */
static bool ota_flash_append(const uint8_t *buf, uint32_t len)
{
    HAL_FLASH_Unlock();

    uint32_t i = 0;
    while (i < len) {
        ota_dw_buf[ota_dw_len++] = buf[i++];
        if (ota_dw_len == 8) {
            uint32_t addr = OTA_SLOT_B_ADDR + ota_dw_prog_off;
            if (!flash_write_dword(addr, ota_dw_buf)) {
                HAL_FLASH_Lock();
                Debug_Print("[OTA] Flash write failed\r\n");
                return false;
            }
            ota_dw_prog_off += 8;
            ota_dw_len = 0;
        }
    }

    HAL_FLASH_Lock();

    ota_crc32 = crc32_update(ota_crc32, buf, len);
    ota_offset += len;
    HAL_IWDG_Refresh(&hiwdg);

    if (ota_offset - ota_last_progress >= OTA_PROGRESS_EVERY || ota_offset >= ota_file_size) {
        ota_last_progress = ota_offset;
        char msg[96];
        snprintf(msg, sizeof(msg), "{\"ota_status\":\"flashing\",\"progress\":%lu,\"total\":%lu}",
                 (unsigned long)ota_offset, (unsigned long)ota_file_size);
        ota_publish(msg);
    }
    return true;
}

/* Public API */
void OTA_Init(void)
{
    ota_state = OTA_ST_IDLE;
    ota_stream_active = ota_stream_rx_complete = false;
    ota_stream_remaining = 0;
    ota_stream_wait_payload = false;
    ota_httpread_stream_started = ota_httpread_done_urc = false;
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_slot_preerased = false;
    ota_preerase_page_idx = 0;
    ota_dw_len = 0;
    ota_dw_prog_off = 0;
    ota_stream_buf_reset();
}

