chenyurong22/STM32-EC200-Firmware/src/ota.c
bool OTA_IsActive(void) { return ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR; }

/* Returns true (and clears sentinel) iff this boot followed an intentional
 * OTA reboot triggered by OTA_ST_REBOOT.  Returns false for HardFault or
 * any other unexpected reset. */
bool OTA_WasRebootPending(void)
{
    if (ota_reboot_sentinel == OTA_REBOOT_SENTINEL) {
        ota_reboot_sentinel = 0;
        return true;
    }
    return false;
}
/* Returns true (and clears sentinel) iff CFUN was pre-done in OTA_ST_REBOOT.
 * Modem_Init uses this to skip its own CFUN reset after an OTA reboot.    */
bool OTA_WasCFUNPreDone(void)
{
    if (ota_cfun_done_sentinel == OTA_CFUN_DONE_SENTINEL) {
        ota_cfun_done_sentinel = 0;
        return true;
    }
    return false;
}

bool OTA_BinaryPending(void) { return ota_stream_active; }
bool OTA_ShouldYieldRx(void) { return ota_stream_active && ota_stream_buf_count >= OTA_STREAM_YIELD_THRESHOLD; }
bool OTA_ExpectingHttpReadConnect(void)
{
    /* Bug2: also gate on !ota_stream_rx_complete so this doesn't re-activate
     * after the stream has already completed and ota_stream_active went false. */
    return (ota_state == OTA_ST_HTTP_READFILE &&
            ota_httpread_stream_started &&
            !ota_stream_active &&
            !ota_stream_rx_complete);
}

void OTA_ForceHttpReadStream(void)
{
    ota_httpread_stream_started = true;
    ota_stream_active = false;
    ota_stream_rx_complete = false;
    ota_stream_remaining = ota_file_size;
    ota_stream_wait_payload = true;
    ota_httpread_done_urc = false;
    ota_stream_buf_reset();
    Debug_Print("[OTA] Armed direct QHTTPREAD stream mode\r\n");
}

void OTA_SetSendFn(OTA_SendFn fn)    { ota_send_fn    = fn; }
void OTA_SetPublishFn(OTA_PublishFn fn) { ota_publish_fn = fn; }
void OTA_SetRecvFn(OTA_RecvFn fn)   { ota_recv_fn    = fn; }

void OTA_FeedByte(uint8_t b)
{
    if (ota_stream_active)
    {
        ota_state_ms = HAL_GetTick();   // Keep timeout alive during streaming

        if (ota_stream_wait_payload)
        {
            if (b == '\n') ota_stream_wait_payload = false;
            return;
        }

        if (!ota_stream_buf_push(b)) {
            ota_stream_active = false;
            ota_error("stream buffer overflow");
            return;
        }

        if (ota_stream_remaining > 0) ota_stream_remaining--;
        if (ota_stream_remaining == 0) {
            ota_stream_active = false;
            ota_stream_rx_complete = true;
        }
        return;
    }
}

/* Start Functions */
void OTA_Start(const char *url)
{
    if (OTA_IsActive()) return;

    strncpy(ota_url, url, sizeof(ota_url)-1);
    ota_url[sizeof(ota_url)-1] = '\0';

    ota_file_size = ota_offset = 0;
    ota_crc32 = 0xFFFFFFFFUL;
    ota_last_progress = 0;
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_slot_preerased = false;
    ota_preerase_page_idx = 0;
    ota_dw_len = 0;
    ota_dw_prog_off = 0;
    ota_stream_buf_reset();

    ota_publish("{\"ota_status\":\"starting\"}");

    if (strncmp(ota_url, "https://", 8) == 0) {
        Debug_Print("[OTA] Enabling HTTPS\r\n");
        ota_send("AT+QHTTPCFG=\"ssl\",1");
        ota_enter(OTA_ST_SSL_ENABLE, OTA_SSL_STEP_TIMEOUT_MS);
    } else {
        char cmd[32];
        snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
        ota_send(cmd);
        ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
    }
}

void OTA_StartFromGet(const char *url)
{
    if (OTA_IsActive()) return;

    strncpy(ota_url, url, sizeof(ota_url)-1);
    ota_url[sizeof(ota_url)-1] = '\0';

    ota_file_size = ota_offset = 0;
    ota_crc32 = 0xFFFFFFFFUL;
    ota_last_progress = 0;
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_slot_preerased = false;
    ota_preerase_page_idx = 0;
    ota_dw_len = 0;
    ota_dw_prog_off = 0;
    ota_stream_buf_reset();

    ota_publish("{\"ota_status\":\"http_get\"}");
    ota_send_qhttpget();
    ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
}

/* Handle Line */
void OTA_HandleLine(const char *line)
{
    /* Bug3: "CONNECT" excluded — printing during CONNECT blocks UART ~26ms,
     * losing binary stream bytes. Only log non-stream control lines. */
    if (strstr(line, "+QHTTPGET") || strstr(line, "+QHTTPREAD") ||
        strstr(line, "ERROR") || strstr(line, "+CME"))
    {
        char dbg[128];
        snprintf(dbg, sizeof(dbg), "[OTA] Received: %s\r\n", line);
        Debug_Print(dbg);
    }

    if (ota_is_exact_reboot_urc(line)) {
        ota_error("modem rebooted during ota");
        return;
    }

    switch (ota_state)
    {
    case OTA_ST_SSL_ENABLE:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"seclevel\",1,1");
            ota_enter(OTA_ST_SSL_SECLEVEL, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL enable failed");
        break;

    case OTA_ST_SSL_SECLEVEL:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"cacert\",1,\"cacert.pem\"");
            ota_enter(OTA_ST_SSL_CACERT, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL seclevel failed");
        break;

    case OTA_ST_SSL_CACERT:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"sslversion\",1,4");
            ota_enter(OTA_ST_SSL_VERSION, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL cacert failed");
        break;

    case OTA_ST_SSL_VERSION:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
            ota_enter(OTA_ST_SSL_CIPHER, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL version failed");
        break;

    case OTA_ST_SSL_CIPHER:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QHTTPCFG=\"sslctxid\",1");
            ota_enter(OTA_ST_SSL_CTXID, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL cipher failed");
        break;

    case OTA_ST_SSL_CTXID:
        if (strcmp(line, "OK") == 0) {
            char cmd[32];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
            ota_send(cmd);
            ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
        } else if (strstr(line, "ERROR")) ota_error("SSL ctxid failed");
        break;

