chenyurong22/STM32-EC200-Firmware/src/ota.c
    case OTA_ST_HTTP_URL_CMD:
        if (strstr(line, "CONNECT")) {
            if (ota_send_fn) ota_send_fn(ota_url);
            ota_enter(OTA_ST_HTTP_URL_BODY, 10000);
        } else if (strstr(line, "ERROR")) ota_error("QHTTPURL cmd failed");
        break;

    case OTA_ST_HTTP_URL_BODY:
        if (strcmp(line, "OK") == 0) {
            ota_send_qhttpget();
            ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
            ota_publish("{\"ota_status\":\"downloading\"}");
        } else if (strstr(line, "ERROR")) ota_error("QHTTPURL body failed");
        break;

    case OTA_ST_HTTP_GET:
        if (strstr(line, "+QHTTPGET:") || strstr(line, "QHTTPGET:"))
        {
            const char *qline = line;

            const char *c = strchr(qline, ':');
            if (c) {
                c++;
                while (*c == ' ') c++;
                if (!strchr(c, ',')) {
                    int qerr = atoi(c);
                    if (qerr != 0) {
                        if (qerr == 709 || qerr == 714 || qerr == 732) {
                            if (qerr == 732) ota_heal_https_ctx();
                            char why[32]; snprintf(why, sizeof(why), "qerr %d", qerr);
                            if (ota_retry_qhttpget(why)) break;
                        }
                        char why[64]; snprintf(why, sizeof(why), "QHTTPGET err %d", qerr);
                        ota_error(why);
                        break;
                    }
                }
            }

            const char *p = strchr(qline, ',');
            int http_code = 0;
            while (p) {
                http_code = atoi(p + 1);
                if (http_code == 200 || http_code == 206) break;
                p = strchr(p + 1, ',');
            }

            if (http_code != 200 && http_code != 206) {
                ota_error("HTTP not 200/206");
                break;
            }

            p = strchr(p + 1, ',');
            if (p) ota_file_size = (uint32_t)atoi(p + 1);

            if (ota_file_size == 0 || ota_file_size > OTA_SLOT_SIZE) {
                ota_error("bad file size");
                break;
            }

            ota_publish("{\"ota_status\":\"downloading\",\"mode\":\"stream\"}");

            /* Enter non-blocking PREERASE state: OTA_Process erases one page per call.
             * This avoids blocking the UART byte loop while Slot B is erased. */
            ota_preerase_page_idx = 0;
            Debug_Print("[OTA] Queuing non-blocking Slot B erase\r\n");
            ota_enter(OTA_ST_PREERASE, OTA_CMD_TIMEOUT_MS);
        }
        else if (strstr(line, "ERROR") || strstr(line, "+CME"))
        {
            if (!ota_retry_qhttpget("ERROR"))
                ota_error("QHTTPGET failed");
        }
        break;

    case OTA_ST_HTTP_READFILE:
        if (strncmp(line, "CONNECT", 7) == 0 && ota_httpread_stream_started && !ota_stream_active)
        {
            /* Bug3: No Debug_Print here — would block UART ~26ms losing stream bytes.
             * Bug fix: stream_wait_payload = FALSE because modem.c's ota_skip_to_lf
             * already consumed the " N\r\n" suffix and the '\n'. The very next bytes
             * from OTA_FeedByte are raw binary data, not a payload header. */
            ota_stream_active = true;
            ota_stream_wait_payload = false;
            break;
        }

        if (strstr(line, "+QHTTPREAD:"))
        {
            int err = -1;
            const char *p = strchr(line, ':');
            if (p) err = atoi(p + 1);

            if (err == 0) {
                ota_httpread_done_urc = true;
                Debug_Print("[OTA] +QHTTPREAD: 0 - download finished\r\n");
                if (!ota_stream_active && ota_stream_buf_count == 0) {
                    if (ota_offset == ota_file_size)
                        ota_enter(OTA_ST_FLAG_WRITE, 0);
                    else
                        ota_error("download size mismatch");
                }
            } else {
                if (!ota_retry_qhttpread("QHTTPREAD error"))
                    ota_error("QHTTPREAD failed");
            }
            break;
        }

        if (strstr(line, "ERROR") || strstr(line, "+CME"))
        {
            if (!ota_retry_qhttpread("ERROR"))
                ota_error("QHTTPREAD failed");
        }
        break;

    default:
        break;
    }
}

/* Process */
void OTA_Process(void)
{
    while (ota_stream_buf_count > 0)
    {
        uint32_t n = ota_stream_buf_pop_chunk(ota_bin_buf, OTA_CHUNK_SIZE);
        if (n > 0 && !ota_flash_append(ota_bin_buf, n)) {
            ota_error("flash write failed");
            return;
        }
    }

    if (ota_stream_rx_complete && ota_stream_buf_count == 0 && ota_state == OTA_ST_HTTP_READFILE)
    {
        ota_stream_rx_complete = false;
        if (ota_offset == ota_file_size) {
            /* All expected bytes received and flushed to flash.
             * Proceed regardless of +QHTTPREAD: 0 URC timing — the URC may
             * arrive slightly after the last data byte, before Modem_Process
             * has a chance to process it.  CRC32 in the bootloader catches
             * any corruption independently. */
            if (!ota_flash_flush_pending()) {
                ota_error("flash flush failed");
            } else {
                ota_enter(OTA_ST_FLAG_WRITE, 0);
            }
        } else {
            char _d[72];
            snprintf(_d, sizeof(_d), "[OTA] ERR off=%lu fsize=%lu urc=%d\r\n",
                     (unsigned long)ota_offset, (unsigned long)ota_file_size,
                     (int)ota_httpread_done_urc);
            Debug_Print(_d);
            ota_error("size mismatch");
        }
    }

    if (ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR)
        HAL_IWDG_Refresh(&hiwdg);

    if (ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR && ota_timeout_ms > 0)
    {
        if (HAL_GetTick() - ota_state_ms > ota_timeout_ms)
            ota_error("state timeout");
    }

    switch (ota_state)
    {
    case OTA_ST_PREERASE:
    {
        /* Erase one 2KB page of Slot B per OTA_Process call (~30ms/page).
         * Modem_Process runs between each call, keeping the UART drained.
         * After all 28 pages are erased, arm the stream and send AT+QHTTPREAD. */
        const uint32_t first_page = (OTA_SLOT_B_ADDR - FLASH_BASE) / OTA_PAGE_SIZE;
        const uint32_t num_pages  = OTA_SLOT_SIZE / OTA_PAGE_SIZE;  /* 28 */

        if (ota_preerase_page_idx < num_pages) {
            {
                char _d[40];
                snprintf(_d, sizeof(_d), "[OTA] erase p=%lu/%lu\r\n",
                         (unsigned long)ota_preerase_page_idx,
                         (unsigned long)num_pages);
                Debug_Print(_d);
            }
            if (!ota_erase_page_safe(first_page + ota_preerase_page_idx)) {
                ota_error("slot B erase failed");
                break;
            }
            ota_preerase_page_idx++;
        } else {
            /* All pages erased — arm stream and fire AT+QHTTPREAD */
            ota_slot_preerased = true;
            Debug_Print("[OTA] Slot B erased OK\r\n");
            OTA_ForceHttpReadStream();
            /* Set state directly (no ota_enter Debug_Print) so UART stays
             * free; OTA_ExpectingHttpReadConnect() becomes true immediately. */
            ota_state      = OTA_ST_HTTP_READFILE;
            ota_state_ms   = HAL_GetTick();
            ota_timeout_ms = OTA_READ_TIMEOUT_MS;
            /* Send AT+QHTTPREAD — CONNECT + binary arrive ~10-50ms later.
             * No Debug_Print or delays after this point. */
            char cmd[64];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPREAD=%lu",
                     (unsigned long)(OTA_CMD_TIMEOUT_MS / 1000UL));
            ota_send(cmd);
        }
        break;
    }

    case OTA_ST_FLAG_WRITE:
    {
        uint32_t final_crc = ota_crc32 ^ 0xFFFFFFFFUL;

        FLASH_EraseInitTypeDef er = {
            .TypeErase = FLASH_TYPEERASE_PAGES,
            .Banks = FLASH_BANK_1,
            .Page = (OTA_FLAGS_ADDR - FLASH_BASE) / OTA_PAGE_SIZE,
            .NbPages = 1
        };
        uint32_t err;
        HAL_FLASH_Unlock();
        HAL_IWDG_Refresh(&hiwdg);
        if (HAL_FLASHEx_Erase(&er, &err) != HAL_OK || err != 0xFFFFFFFFUL) {
            HAL_FLASH_Lock();
            ota_error("flags erase failed");
            break;
        }

