chenyurong22/STM32-EC200-Firmware/src/ota.c
        uint64_t word0, word1;
        uint32_t w0[2] = {OTA_MAGIC, ota_file_size};
        uint32_t w1[2] = {final_crc, 0xFFFFFFFFUL};
        memcpy(&word0, w0, 8);
        memcpy(&word1, w1, 8);

        bool ok = (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR, word0) == HAL_OK) &&
                  (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR + 8, word1) == HAL_OK);

        HAL_FLASH_Lock();
        HAL_IWDG_Refresh(&hiwdg);

        if (!ok) {
            ota_error("flags write failed");
            break;
        }

        ota_publish("{\"ota_status\":\"rebooting\"}");
        ota_enter(OTA_ST_REBOOT, 1000);
        break;
    }

    case OTA_ST_REBOOT:
        if (HAL_GetTick() - ota_state_ms >= 1000)
        {
            ota_send("AT+QHTTPSTOP");
            ota_delay_wdg(3000);
            ota_send("AT+QIDEACT=1");
            ota_delay_wdg(5000);
            /* Reset modem so TLS heap clears and LTE re-registration
             * starts before STM32 reboots.  Wait for "APP RDY" URC to
             * confirm the modem actually processed AT+CFUN=1,1.
             * Only set cfun_done sentinel if APP RDY is confirmed —
             * if CFUN failed silently the sentinel stays clear and
             * Modem_Init's fallback path does CFUN itself.             */
            Debug_Print("[OTA] Pre-reset CFUN — waiting for APP RDY\r\n");
            ota_send("AT+CFUN=1,1");
            bool app_rdy = ota_wait_app_rdy(60000); /* up to 60 s */
            if (app_rdy) {
                Debug_Print("[OTA] APP RDY confirmed — settling 20s for LTE\r\n");
                ota_delay_wdg(20000); /* let LTE registration start    */
                ota_cfun_done_sentinel = OTA_CFUN_DONE_SENTINEL;
            } else {
                Debug_Print("[OTA] APP RDY timeout — Modem_Init will CFUN\r\n");
                /* cfun_done NOT set; Modem_Init fallback does CFUN     */
            }
            ota_reboot_sentinel = OTA_REBOOT_SENTINEL;
            NVIC_SystemReset();
        }
        break;

    default:
        break;
    }
}